app/views/offices/show.html.erb

<h3>The Employees Working in This Office:</h3>
<% @office.company.employees.each do |e| %>
---
SELECT "employees".* FROM "employees" WHERE "employees"."company_id" = ?  [["company_id", 3]]