app/views/buildings/show.html.erb

<ul>
<% @building.companies.each do |c| %>
---
SELECT "companies".* FROM "companies" INNER JOIN "offices" ON "companies"."id" = "offices"."company_id" WHERE "offices"."building_id" = ?  [["building_id", 1]]