app/views/companies/_form.html.erb

SELECT "buildings".* FROM "buildings"
---
<p>Building Floors Available</p>
	<% Building.all.each do |b| %>