app/views/companies/show.html.erb

SELECT "offices".* FROM "offices" WHERE "offices"."company_id" = ?  [["company_id", 1]]
---
<h3>Company's office:</h3>
<% if @company.offices.length < 1%>

SELECT "employees".* FROM "employees" WHERE "employees"."company_id" = ?  [["company_id", 1]]
---
<h3>All Employees:</h3>
<% @company.employees.each do |e| %>