app/controllers/buildings_controller.rb

SELECT "buildings".* FROM "buildings"
---
    def index
        @buildings = Building.all

UPDATE "buildings" SET "number_of_floors" = ?, "updated_at" = ? WHERE "buildings"."id" = ?  [["number_of_floors", 9], ["updated_at", "2020-12-17 02:49:06.653402"], ["id", 1]]
---
    def update
        if @building.update(building_params(:name, :country, :address, :rent_per_floor, :number_of_floors))

SELECT  "buildings".* FROM "buildings" WHERE "buildings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_building
        @building = Building.find(params[:id])