app/controllers/companies_controller.rb

    def show
        @company = Company.find(params[:id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @company = Company.create(company_params(:name))
---
INSERT INTO "companies" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "LOL company"], ["created_at", "2020-12-16 04:53:09.383037"], ["updated_at", "2020-12-16 04:53:09.383037"]]