app/controllers/employees_controller.rb

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 101], ["LIMIT", 1]]
---
    def show
        @employee = Employee.find(params[:id])

SELECT "companies".* FROM "companies"
---
    def new
        @employee = Employee.new
        @companies = Company.all

INSERT INTO "employees" ("name", "title", "company_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "aaaaaa"], ["title", "bbbbbbb"], ["company_id", 8], ["created_at", "2020-12-17 03:56:07.007805"], ["updated_at", "2020-12-17 03:56:07.007805"]]
---
    def create
        @employee = Employee.create(employee_params(:name, :title, :company_id))

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 101], ["LIMIT", 1]]
DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 101]]
---
    def destroy
        @employee = Employee.find(params[:id])
        @employee.destroy