app/controllers/offices_controller.rb

    def show
        @office = Office.find(params[:id])
---
SELECT  "offices".* FROM "offices" WHERE "offices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]